benchmark/leveldb/results/ratio/mris_ratio_ssd.64.3.log
LevelDB:    version 1.5
Date:       Sun Dec  2 22:41:08 2012
CPU:        1 * Intel(R) Xeon(TM) CPU 2.80GHz
CPUCache:   2048 KB
Keys:       16 bytes each
Values:     2 resolutions
            8196 byte (8196 after compression)
            131072 byte (131072 after compression)
Entries:    100000
RawSize:    0.13 MB (estimated)
FileSize:   0.13 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
mris_facebook :    1564.523 micros/op;    6.2 MB/s small: 5000/0; big: 79/0
Microseconds per op:
Count: 5079  Average: 1564.5607  StdDev: 1318.39
Min: 0.0000  Median: 1474.5261  Max: 7426.0000
------------------------------------------------------
[       0,       1 )       9   0.177%   0.177% 
[       1,       2 )      10   0.197%   0.374% 
[       2,       3 )      51   1.004%   1.378% 
[       3,       4 )       8   0.158%   1.536% 
[      14,      16 )       1   0.020%   1.555% 
[      18,      20 )       1   0.020%   1.575% 
[      20,      25 )      12   0.236%   1.811% 
[      25,      30 )      45   0.886%   2.697% 
[      30,      35 )      87   1.713%   4.410% 
[      35,      40 )     409   8.053%  12.463% ##
[      40,      45 )     281   5.533%  17.996% #
[      45,      50 )       8   0.158%  18.153% 
[      50,      60 )      30   0.591%  18.744% 
[      60,      70 )       3   0.059%  18.803% 
[      80,      90 )      92   1.811%  20.614% 
[      90,     100 )     221   4.351%  24.966% #
[     100,     120 )     160   3.150%  28.116% #
[     120,     140 )     112   2.205%  30.321% 
[     140,     160 )      70   1.378%  31.699% 
[     160,     180 )      22   0.433%  32.132% 
[     180,     200 )      12   0.236%  32.369% 
[     200,     250 )      11   0.217%  32.585% 
[     250,     300 )       1   0.020%  32.605% 
[     400,     450 )       5   0.098%  32.703% 
[     450,     500 )       4   0.079%  32.782% 
[     500,     600 )       7   0.138%  32.920% 
[     600,     700 )       1   0.020%  32.940% 
[     700,     800 )      17   0.335%  33.274% 
[     800,     900 )      39   0.768%  34.042% 
[     900,    1000 )      93   1.831%  35.873% 
[    1000,    1200 )     238   4.686%  40.559% #
[    1200,    1400 )     165   3.249%  43.808% #
[    1400,    1600 )     844  16.617%  60.425% ###
[    1600,    1800 )      56   1.103%  61.528% 
[    1800,    2000 )      10   0.197%  61.725% 
[    2000,    2500 )      46   0.906%  62.630% 
[    2500,    3000 )    1546  30.439%  93.070% ######
[    3000,    3500 )     239   4.706%  97.775% #
[    3500,    4000 )      32   0.630%  98.405% 
[    4000,    4500 )      17   0.335%  98.740% 
[    4500,    5000 )       1   0.020%  98.760% 
[    5000,    6000 )      28   0.551%  99.311% 
[    6000,    7000 )      14   0.276%  99.587% 
[    7000,    8000 )      21   0.413% 100.000% 

----- /mnt/largespace/mris_ratio_ssd_db statistics: -----
nr_new_large_values_ 	0
nr_success_lookups_ 	79
nr_failed_lookups_ 	0
nr_failed_inserts_ 	0